import random as r
import pandas as pd

# ---------------------------------------------------------------------
# 1) 1~100 사이 임의의 숫자 30개 구성
# ---------------------------------------------------------------------
L=[]
while True:
    R=r.randint(1,100)
    L.append(R)
    if len(L)==30: break
sr1=pd.Series(L,name='Series1')
print(sr1)

# ---------------------------------------------------------------------
# 2) 1~100 사이 임의의 숫자 30개 구성
#    중복없음
# ---------------------------------------------------------------------
L=[]
while True:
    R=r.randint(1,100)
    if R not in L: L.append(R)
    if len(L)==30: break
sr2=pd.Series(L,name='Series2')
print(sr2)

# ---------------------------------------------------------------------
# 3) 0.0~1.0 사이의 실수 데이터 10개로 구성
# ---------------------------------------------------------------------
L=[]
for _ in range(10):
    R=round(r.random(),1)
    L.append(R)
sr3=pd.Series(L,name='Series3')
print(sr3)